# taps
tap "adoptopenjdk/openjdk"
tap "github/gh"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "mongodb/brew"

# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Core application library for C
brew "glib"
# Emacs dependency management
brew "cask"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Configurable talking characters in ASCII art
brew "cowsay"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Distributed revision control system
brew "git"
# GNU grep, egrep and fgrep
brew "grep"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Rainbows and unicorns in your console!
brew "lolcat"
# Swiss Army Knife for macOS
brew "m-cli"
# Mac App Store command-line interface
brew "mas"
# MP3 player for Linux and UNIX
brew "mpg123"
# NCurses Disk Usage
brew "ncdu"
# Fast, highly customisable system info script
brew "neofetch"
# Utility for managing network connections
brew "netcat"
# Diagnose infrastructure problems with metrics, visualizations & alarms
brew "netdata"
# Small build system for use with gyp or CMake
brew "ninja"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Monitor data's progress through a pipe
brew "pv"
# Command-line packet analyzer
brew "tcpdump"
# User interface to the TELNET protocol
brew "telnet"
# Programmatically correct mistyped console commands
brew "thefuck"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Digital clock in ncurses
brew "tty-clock"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai", args: ["HEAD"]
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# AdoptOpenJDK OpenJDK (Java) Development Kit
cask "adoptopenjdk8"
# Application launcher and productivity software
cask "alfred"
# Android SDK component
cask "android-platform-tools"
cask "background-music"
# GUI app for Homebrew
cask "cakebrew"
# System cleaner for logs, caches and more
cask "clean-me"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Timer application
cask "michaelvillar-timer"
# Open-source download manager
cask "motrix"
# Finder Toolbar app to open the current directory in Terminal or Editor
cask "openinterminal"
# Instant messaging application focusing on security
cask "signal"
# Music streaming service
cask "spotify"
# Network protocol analyzer
cask "wireshark"

# mac app store
mas "Developer", id: 640199958
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Twitter", id: 1482454543
mas "Xcode", id: 497799835
